// *문제
// 5종류의 체스말 존재 
// *1 : 한방향, *2 : 좌우, *3 : 90도 차이가 나는 2방향, *4 : 위, 양옆, *5 : 4방향 전부
// 1은 바라보는 방향에 따라 이동할수 있는 격자가 달라짐
// 나머지 말들은 독립적으로 바라보는 방향을 지정할수있음
// *말이동규칙
// *1)본인의 말은 뛰어넘어 지나갈수 있음
// *2)상대편 말은 뛰어넘어 지나갈수 없음
// *3)갈수없는 격자 크기 계산시 상대편 말 위치 계산 X

// *입력
// 1)체크판의 크기 n,m (1~8)
// 2~n+1) 체스판에 있는 자신의 말(1~5)과 상대의 말(6)
// *자신의 말의 개수는 최대 8개
// *출력
// 비어있음에도 자신의 말을 이용해 갈수없는 체스판의 영역 넓이의 총합의 최솟값

//*유의사항
// 1번말의 방향은 내가 정하는것이며 그 방향으로 계속 이동
//
#include <iostream>

int main() {
    // 여기에 코드를 작성해주세요. 
    return 0;
}